{
  "portfolioItems": [
    {
      "id": "reece-ngp",
      "title": "Uplifting the Selling Experience at Reece",
      "description": "Developed a custom point-of-sale solution for Reece Group that reduced transaction time by 23% and slashed staff training requirements from six months to just weeks, while enabling seamless multi-device functionality.",
      "imageUrl": "ngp.png",
      "imageAlt": "Reece | Next Gen POS",
      "company": "Reece | Next Gen POS",
      "content": "<h3>Company Background</h3><p>Reece Group operates approximately 700 specialised retail and wholesale branches across Australia and New Zealand, primarily serving the plumbing, bathroom, and HVAC industries. The company's business model combines trade counter operations with complex quoting systems and specialised product knowledge. Reece serves diverse customers from commercial contractors to individual tradespeople, requiring sophisticated systems to handle varied transaction types, customer-specific pricing, and inventory management. While the company's success was built on exceptional service, legacy technologies were becoming a bottleneck for staff efficiency and customer experience.</p><h3>Product Challenge</h3><p>Reece's point-of-sale ecosystem had evolved into a complex and fragmented collection of applications that created significant operational challenges:</p><ul><li>Eight separate applications were required to handle different aspects of the customer transaction journey</li><li>Legacy technology was increasingly obsolete, limiting maintenance and enhancement opportunities</li><li>New employees required six months to achieve operational competency across all applications</li><li>Even minor feature changes required coordinated updates across multiple codebases</li><li>No off-the-shelf solution could adequately address Reece's specialised wholesale/retail hybrid model</li><li>The complexity hampered innovation speed and business agility</li></ul><h3>My Contribution</h3><p>I led the creation of Next Gen POS, a unified solution that transformed Reece's point-of-sale operations:</p><ul><li>Designed and developed a unified, web-based system built with React that consolidated functionality</li><li>Implemented responsive design for consistent operation across desktop terminals, tablets, and mobile devices</li><li>Architected a comprehensive API integration layer connecting with Reece's existing business systems</li><li>Led user-centred design research with branch staff to simplify workflows and prioritise common tasks</li><li>Created an intuitive interface that significantly reduced training requirements</li><li>Developed a modular architecture enabling rapid feature development and deployment</li></ul><h3>Measures of Success</h3><p>The Next Gen POS implementation has delivered substantial improvements to Reece's operations:</p><ul><li>Average transaction completion time reduced from 5.5 minutes to 4.2 minutes (23% improvement)</li><li>Staff training time to achieve operational competency reduced from six months to just weeks</li><li>Successfully deployed to approximately 700 branches, processing millions of dollars in daily transactions</li><li>Responsive design enabled new mobile workflows, allowing staff to serve customers anywhere in the store</li><li>Web-based interface significantly improved learnability, particularly for new staff already familiar with web applications</li><li>Created a unified platform that simplified future enhancements and integrations across the business</li></ul>"
    },
    {
      "id": "reece-reeceid",
      "title": "An omni-channel customer data platform",
      "description": "Implementation of a comprehensive Customer Data Platform that unified 850,000 fragmented customer profiles across Reece's ecosystem into a single platform, enabling seamless omni-channel experiences and increasing identifiable transactions by 30%.",
      "imageUrl": "reeceid-mongodb-atlas.png",
      "imageAlt": "Reece | ReeceID Customer Data Platform",
      "company": "Reece | ReeceID Customer Data Platform",
      "content": "<h3>Company Background</h3><p>Reece Group is a leading supplier of plumbing, bathroom and HVAC products across Australia and New Zealand, operating approximately 700 branches along with digital sales channels. The company serves a diverse range of customers from individual tradespeople to large commercial contractors, with each customer segment having unique needs and engagement patterns. Reece built its reputation on exceptional customer service and specialist knowledge, differentiating itself in a competitive market through personalized experiences and trade expertise. As the company expanded its digital offerings alongside its traditional branch network, maintaining a cohesive view of customer relationships became increasingly challenging but critically important to preserving the company's customer-centric advantage.</p><h3>Product Challenge</h3><p>Reece's growth over time had resulted in a fragmented customer data landscape that significantly impacted the customer experience:</p><ul><li>Customer profiles were scattered across multiple disconnected systems including branch POS, e-commerce platforms, and marketing databases</li><li>Customers experienced jarring inconsistencies when interacting with Reece across different channels</li><li>Purchases made in-store would not appear in customers' digital account histories</li><li>Contact information updates made in one channel (such as the mobile app) wouldn't propagate to other systems</li><li>Marketing efforts were hampered by incomplete or inconsistent customer data</li><li>Analytics and customer insights were compromised by the inability to track complete customer journeys</li><li>Business decisions were based on partial views of customer behavior rather than holistic understanding</li></ul><h3>My Contribution</h3><p>I spearheaded the development of a unified Customer Data Platform that transformed Reece's ability to deliver cohesive customer experiences:</p><ul><li>Led the creation of a centralized platform that unified 850,000 customer profiles across digital, retail, and marketing platforms</li><li>Implemented both deterministic and probabilistic matching using machine learning to accurately connect fragmented customer records</li><li>Established the unique ReeceID as the universal customer identifier across all company systems</li><li>Orchestrated the integration of this unified customer view into 11 different platforms across the organization</li><li>Developed a refreshed app and website experience for customers to manage their account details and information</li><li>Created internal utility tools for Reece employees to better serve customers with comprehensive profile data</li><li>Developed governance frameworks and data quality processes to maintain data integrity over time</li><li>Created APIs and event-driven architecture to ensure real-time propagation of customer data changes</li><li>Built privacy controls and consent management to ensure regulatory compliance</li><li>Established tracking and monitoring systems to measure the platform's business impact</li></ul><h3>Measures of Success</h3><p>The Customer Data Platform delivered significant improvements to Reece's operations and customer experience:</p><ul><li>Successfully processes 1.4 million customer transactions monthly with unique customer identification</li><li>Increased the proportion of transactions with associated contact information by 30%</li><li>Eliminated customer frustration from inconsistent experiences across channels</li><li>Enabled personalized marketing with significantly improved targeting accuracy</li><li>Provided a comprehensive 360-degree view of customer interactions across all touchpoints</li><li>Streamlined operations by reducing duplicate customer service efforts across channels</li><li>Created a foundation for advanced analytics and AI-driven customer insights</li><li>Improved data quality and governance across the entire organization</li></ul>"
    },        
    {
      "id": "reece-search",
      "title": "Personalised faceted search surfacing 180k products",
      "description": "Transformed Reece's outdated manual search system into a hyper-personalized Elastic Search platform with real-time product data, dramatically improving accuracy and user experience across all channels",
      "imageUrl": "reece-search.png",
      "imageAlt": "A hyperpersonalised search experience | Reece",
      "company": "Reece: Transforming Product Discovery",
      "content": "<h3>Company Background</h3><p>Reece is an ASX:100 listed company with a vast catalogue of over 180,000 products. As a leading supplier in their industry, they serve diverse customer segments across multiple channels including retail stores, digital platforms, and trade partnerships.</p><h3>Product Background</h3><p>The legacy search engine at Reece suffered from significant limitations that undermined the customer experience:</p><ul><li>Manual prioritisation of search results created inconsistencies</li><li>Slow performance degraded user satisfaction</li><li>Inaccurate results led to lost sales opportunities</li><li>Nightly batch updates meant product information was frequently outdated</li><li>Limited personalisation capabilities failed to meet modern user expectations</li></ul><h3>My Contribution</h3><p>I led the development of a hyper-personalised search engine built on Elastic Search technology, transforming how customers discover products across Reece's digital ecosystem.</p><p><strong>Key Innovations:</strong></p><ul><li>Implemented real-time data feeds from multiple product APIs, eliminating outdated information</li><li>Designed a cross-platform solution serving web, mobile applications, and point-of-sale systems</li><li>Developed sophisticated personalisation algorithms to deliver contextually relevant results</li><li>Created a scalable architecture supporting the entire 180,000+ product catalogue</li><li>Integrated analytics to continuously improve result relevance</li></ul><p><strong>Measured Success:</strong></p><ul><li>Improved product position accuracy by 37%, ensuring customers found relevant items faster</li><li>Reduced average click position from 3.8 to 2.1, indicating more relevant first-page results</li><li>Decreased zero-result searches by 42%, significantly reducing customer frustration</li><li>Increased conversion rate by 18% across digital platforms</li><li>Reduced search latency down to 32ms from 1.5seconds, delivering near-instantaneous results</li></ul><p>This project reflects my efforts in product leadership: I worked to understand user challenges, find suitable technology solutions, and track progress with metrics that showed business value.</p>"
    },
    {
      "id": "airbnb-qantas",
      "title": "Airbnb-Qantas Strategic Partnership",
      "description": "Supported the development of a strategic integration between Airbnb and Qantas Hotels, enabling millennial travellers to discover alternative accommodations on Qantas.com while earning Frequent Flyer points, benefiting both brands through shared audience engagement.",
      "imageUrl": "airbnb.png",
      "imageAlt": "Airbnb-Qantas Strategic Partnership",
      "company": "Hooroo | Qantas Hotels",
      "content": "<h3>Company Background</h3><p>Qantas, Australia's flag carrier and largest airline by fleet size, has cultivated a prestigious reputation through its century-long history. The Qantas Frequent Flyer program stands as one of Australia's most recognised loyalty schemes with millions of active members. The company identified a critical gap in capturing the growing millennial travel market that increasingly preferred authentic, local experiences over standard hotel stays.</p><h3>Product Challenge</h3><p>Airbnb, despite its global success, faced legitimacy challenges in certain markets including Australia, where traditional travellers remained hesitant about alternative accommodation. Simultaneously, Qantas sought to refresh its brand perception amongst younger demographics without alienating its core business traveller base. Both organisations recognised the potential synergy but needed a seamless integration that would protect their respective brand identities while creating mutual value. The technical challenge involved connecting two distinct platforms with minimal friction while maintaining tracking integrity for the commercial partnership.</p><h3>My Contribution</h3><p>I led the cross-organisational product team during the Melbourne summit, facilitating collaboration between Airbnb's San Francisco product team and Qantas's digital division. We developed an elegant solution that embedded Airbnb's accommodation search directly within the Qantas Hotels platform, maintaining Qantas's premium user experience while showcasing Airbnb's unique inventory. The integration featured a sophisticated handoff that retained user context when transferring to Airbnb's booking flow, followed by a secure callback system for points allocation.</p><h3>Measured Success</h3><p>Our implementation included robust tracking mechanisms measuring search-to-booking conversion rates, points issuance, and careful monitoring to ensure the partnership didn't cannibalise traditional hotel bookings. The integration exceeded targets with a 28% higher-than-projected engagement rate among Qantas Frequent Flyers, 10,000+ completed bookings in the first quarter, and millions of Qantas points awarded. Most importantly, 64% of users who booked Airbnb accommodations through this integration were first-time Airbnb customers, successfully achieving both brands' strategic objectives.</p>"
    },
    {
      "id": "qantas-holidays",
      "title": "Qantas Luxury Holidays for Gold & Platnium Loyalty Members",
      "description": "Developed a targeted luxury hotel platform for high-value Frequent Flyers after identifying a market gap through competitor analysis and customer research. Our rapid-launch approach evolved from a simple landing page to a full booking engine, creating a successful new product line for Qantas.",
      "imageUrl": "qantas-holidays.png",
      "imageAlt": "Qantas Luxury Holidays for Gold & Platnium Loyalty Members",
      "company": "Hooroo | Qantas Hotels",
      "content": "<h3>Company Background</h3><p>Qantas Hotels served as a booking platform for Frequent Flyers, but lacked exclusive offerings for premium members. Competitor & market research revealed Gold and Platinum members were interested in luxury hotel experiences that weren't available through the standard platform. These high-value members represented the airline's most valuable customer segment, making their hotel booking behavior strategically important.</p><h3>Product Challenge</h3><p>Our challenge was to quickly test luxury hotel packages while determining the best booking experience. Specifically, we needed to:</p><ul><li>Validate market demand without lengthy development cycles</li><li>Create an exclusive experience for premium customers</li><li>Identify optimal price points for conversion and margin</li><li>Develop a scalable solution that could be implemented quickly</li><li>Balance personalized service with operational efficiency</li></ul><h3>My Contribution</h3><p>I led a cross-functional approach that delivered rapid results:</p><ul><li>Aligned Sales, Marketing and Product teams around a minimum viable offering within one week</li><li>Launched with a simple HTML landing page and call center fulfillment model</li><li>Initially tested through targeted EDMs to select Frequent Flyers</li><li>Quickly iterated based on call center and customer feedback</li><li>Progressively enhanced the platform with self-service booking capabilities</li><li>Expanded to include flights and ancillary products based on success</li></ul><h3>The outcome</h3><p>Apart from the success listed below, the team developed a platform which paved the way for the Qantas Holidays product that is currently in market. The inclusion of flights and additional ancillary revenue streams (tours, cars, etc) were added to create a full service Packages engine.</p><h3>Measured Success</h3><p>The luxury hotel initiative delivered exceptional results:</p><ul><li>Generated 2,000+ calls on the first day of launch</li><li>Achieved transaction values 36% higher than standard hotel bookings</li><li>Increased gross profit margins by 20 percentage points through better commissions</li><li>Attracted 3,800+ first-time hotel bookers in the first quarter</li><li>Converted 62% of new bookers into repeat customers</li><li>Significantly boosted Qantas points earned and burned</li><li>Created a new growth channel that continues to scale</li></ul>"
    },
    {
      "id": "qantas-hotels-self-service",
      "title": "Qantas Hotels Self-Service Platform",
      "description": "Transformed the Qantas Hotels booking experience by developing a comprehensive self-service platform that eliminated call center dependencies, starting with a simple cancellation feature that evolved into a full suite of digital management tools integrated with the Qantas App.",
      "imageUrl": "qantas-hotels-self-service.png",
      "imageAlt": "Qantas Hotels Self-Service Platform",
      "company": "Hooroo | Qantas Hotels",
      "content": "<h3>Company Background</h3><p>Qantas Hotels operated as the accommodation booking arm of Australia's national carrier, providing hotel reservation services to complement flight bookings. Despite the digital nature of the initial booking process, post-booking management relied entirely on a limited-hours call centre. This created significant friction for international travellers dealing with time zone differences and connectivity challenges whilst abroad. Customer feedback consistently highlighted this disconnect between the modern digital booking experience and the outdated post-booking service model. The situation not only impacted customer satisfaction but also created operational inefficiencies with the call centre handling numerous routine transactions that could potentially be automated.</p><h3>Product Challenge</h3><p>Our research revealed a critical gap in the customer journey: whilst bookings could be made online, any changes required phone interaction with a call centre that wasn't available 24/7. This presented multiple challenges:</p><ul><li>International travellers faced timezone and connectivity barriers when needing to modify bookings</li><li>Call centre resources were consumed by simple transactions that could be automated</li><li>Customer satisfaction metrics showed frustration with the limited service hours</li><li>Competitors were already offering self-service options, creating a competitive disadvantage</li><li>The business needed to reduce operational costs whilst improving customer experience</li></ul><h3>My Contribution</h3><p>I led the development of a phased self-service approach that prioritised high-impact features based on call centre data and customer research:</p><ul><li>Implemented a strategic 'thin slice' approach by embedding a simple cancellation button in confirmation emails rather than building a full portal upfront</li><li>Validated the concept quickly whilst monitoring cancellation rates to ensure we weren't negatively impacting revenue</li><li>Progressively expanded capabilities based on user feedback and business priorities</li><li>Developed a comprehensive self-service experience including viewing reservations, submitting changes, and rebooking</li><li>Created additional value-add features such as reservation sharing and hotel directions</li><li>Integrated the experience into the main Qantas App to create a seamless travel companion</li></ul><h3>Measured Success</h3><p>The self-service platform delivered significant benefits across multiple metrics:</p><ul><li>Maintained stable cancellation rates despite easier cancellation process, disproving concerns about revenue impact</li><li>Achieved measurable NPS improvements as customers appreciated the added convenience</li><li>Generated $150,000 in incremental bookings through the rebooking feature alone</li><li>Reduced call centre volume for routine transactions by 27%</li><li>Increased digital engagement with 18% of customers accessing self-service features</li><li>Improved operational efficiency by shifting simple transactions from call centre to digital channels</li><li>Enhanced the overall travel experience through integration with the main Qantas App</li><li>Created a platform that continues to evolve with additional self-service capabilities</li></ul>"
    },
    {
      "id": "evented-booking-engine",
      "title": "Evented-API Booking Engine Platform",
      "description": "Transformed Qantas Hotels' monolithic booking system into a high-performance, event-driven architecture that reduced booking completion time by 60% while increasing system reliability to 99.9% uptime.",
      "imageUrl": "evented-booking-engine.png",
      "imageAlt": "Hooroo Evented Booking Platform",
      "company": "Hooroo | Qantas Hotels",
      "content": "<h3>Company Background</h3><p>Horoo (later known as Qantas Hotels) began as a startup incubated within Qantas Airways, Australia's flagship carrier. The venture was established to create a comprehensive hotel booking platform that would complement Qantas' flight services and provide customers with a seamless travel planning experience. In its formative years, the team focused on achieving product-market fit and building core capabilities, resulting in a monolithic codebase that handled multiple functions: booking and reservation management, search functionality, account administration, payment processing for both customers and suppliers, and transactional email communications.</p><h3>Product Challenge</h3><p>As Horoo gained traction in the market, the monolithic architecture became increasingly problematic. The intertwined codebase made it difficult to implement new features without affecting existing functionality, significantly slowing down innovation cycles. Development teams faced growing challenges with deployment coordination, testing complexities, and scalability limitations during peak booking periods. System resilience was compromised as failures in one component would frequently impact the entire platform. With ambitious growth targets and plans to expand service offerings, the technical limitations of the monolithic system became a critical business constraint that needed urgent addressing.</p><h3>My Contribution</h3><p>I was involved in the replatforming initiative, transitioning from the monolithic system to a modern CQRS (Command Query Responsibility Segregation) and event-driven architecture. We utilised a phased migration approach, allowing for incremental deployment while maintaining business continuity. The new API/event-driven booking engine was initially released to a targeted customer segment, with systematic expansion as additional capabilities were incorporated. This transformation not only resolved immediate technical challenges but positioned the business for long-term scalability and innovation. The platform's success led to its expansion into airline reservations, becoming the technological foundation of Qantas Hotels & Holidays products.</p><h3>Measures of Success</h3><p>The replatforming initiative delivered significant, measurable improvements across key performance indicators:</p><ul><li>Booking completion time decreased by 5%, providing customers with a faster reservation experience</li><li>System uptime increased to 99.999%, ensuring reliable service even during peak travel seasons</li><li>Developer productivity significantly increased (as did happiness)</li><li>The booking engine technology now serves as the cornerstone of Qantas Hotels & Holidays products</li><li>Established a pattern for future modernisation efforts across the organisation</li></ul>"
    },
    {
      "id": "apnnewsandmedia",
      "title": "Transforming Digital Regional Publishing",
      "description": "Implemented a comprehensive digital editorial platform serving 60 regional mastheads, integrating print content with digital workflows and delivering targeted advertising solutions that supported all digital revenue.",
      "imageUrl": "APN-News-Media.jpg",
      "imageAlt": "APN News & Media",
      "company": "APN News & Media",
      "content": "<h3>Company Background</h3><p>APN News & Digital was a major Australian regional media company operating approximately 60 distinctive mastheads across various geographical locations. Each publication maintained its own identity while sharing a common technological infrastructure. The mastheads featured specialised classifieds sections covering automotive, employment, and real estate markets, alongside a dedicated events platform that promoted local activities. The business model primarily relied on advertising revenue, with millions of daily page impressions across the network providing significant commercial opportunities. The company operated in a challenging period of media transformation, as traditional print publications were navigating the shift to digital content consumption while maintaining revenue streams.</p><h3>Product Challenge</h3><p>The digital transformation journey presented numerous technical and operational challenges. Editorial teams needed to efficiently transition content from print to digital formats while maintaining publishing schedules across multiple mastheads. The existing workflow required manual intervention at multiple points, creating bottlenecks and inconsistent digital experiences. Each masthead had unique requirements, audience demographics, and content priorities that needed to be respected within a standardised technological framework. Additionally, the advertising revenue model demanded more sophisticated targeting capabilities to remain competitive against purely digital platforms with advanced audience segmentation. The solution needed to balance operational efficiency with flexible customisation options for each publication while also exploring new revenue streams beyond traditional advertising.</p><h3>My Contribution</h3><p>I led the implementation of a comprehensive digital editorial platform that streamlined the content journey from print to online publication. The system established automated content ingestion pipelines from print publishing platforms, creating digital-ready content queues for editorial teams to enhance with multimedia elements and SEO optimisation. We developed customisable templates that preserved each masthead's unique branding while standardising the underlying technical infrastructure. We implemented a flexible subscription paywall system that allowed each masthead to determine its own monetisation strategy while maintaining a consistent user experience. The most significant advancement came through implementing the Lotame Data Management Platform (DMP), which enabled sophisticated audience segmentation and targeting capabilities for advertisers. This technology allowed for both on-site contextual targeting and off-site audience extension, creating new revenue opportunities beyond traditional display advertising.</p><h3>Measures of Success</h3><p>The digital transformation delivered substantial improvements to both operations and revenue generation:</p><ul><li>Digital advertising revenue increased by 35% through enhanced targeting capabilities</li><li>Subscription revenue created a new income stream, accounting for 22% of digital revenue</li><li>Audience engagement metrics such as time on site, pages per visit and scroll depth of page</li><li>Technical infrastructure costs decreased by ~20% through standardisation and cloud migration</li></ul>"
    }
  ]
}