{
  "portfolioItems": [
    {
      "id": "reece-search",
      "title": "Personalised faceted search sufacing 180k products",
      "description": "Transformed Reece's outdated manual search system into a hyper-personalized Elastic Search platform with real-time product data, dramatically improving accuracy and user experience across all channels",
      "imageUrl": "reece-search.png",
      "imageAlt": "A hyperpersonalised search experience | Reece",
      "company": "Reece: Transforming Product Discovery",
      "content": "<h3>Company Background</h3><p>Reece is an ASX:100 listed company with a vast catalogue of over 180,000 products. As a leading supplier in their industry, they serve diverse customer segments across multiple channels including retail stores, digital platforms, and trade partnerships.</p><h3>Product Background</h3><p>The legacy search engine at Reece suffered from significant limitations that undermined the customer experience:</p><ul><li>Manual prioritisation of search results created inconsistencies</li><li>Slow performance degraded user satisfaction</li><li>Inaccurate results led to lost sales opportunities</li><li>Nightly batch updates meant product information was frequently outdated</li><li>Limited personalisation capabilities failed to meet modern user expectations</li></ul><h3>My Contribution</h3><p>I led the development of a hyper-personalised search engine built on Elastic Search technology, transforming how customers discover products across Reece's digital ecosystem.</p><p><strong>Key Innovations:</strong></p><ul><li>Implemented real-time data feeds from multiple product APIs, eliminating outdated information</li><li>Designed a cross-platform solution serving web, mobile applications, and point-of-sale systems</li><li>Developed sophisticated personalisation algorithms to deliver contextually relevant results</li><li>Created a scalable architecture supporting the entire 180,000+ product catalogue</li><li>Integrated analytics to continuously improve result relevance</li></ul><p><strong>Measured Success:</strong></p><ul><li>Improved product position accuracy by 37%, ensuring customers found relevant items faster</li><li>Reduced average click position from 3.8 to 2.1, indicating more relevant first-page results</li><li>Decreased zero-result searches by 42%, significantly reducing customer frustration</li><li>Increased conversion rate by 18% across digital platforms</li><li>Reduced search latency down to 32ms from 1.5seconds, delivering near-instantaneous results</li></ul><p>This project reflects my efforts in product leadership: I worked to understand user challenges, find suitable technology solutions, and track progress with metrics that showed business value.</p>"
    },
    {
      "id": "nezasa",
      "title": "Building the future of hyper-personalized travel packages at Nezasa",
      "description": "<p>Nezasa was established in 2012 in Zurich by a group of avid travelers with strong IT skills. Their innovative idea was to simplify travel by developing technology that would remove complexity from multi-destination trip planning.</p>",
      "imageUrl": "nezasa.png",
      "imageAlt": "Nezasa platform screenshot showing travel packages",
      "company": "Nezasa"
    },
    {
      "id": "bmw",
      "title": "BMW: Changing the Way the World Moves",
      "description": "<p>Born in September 2018, Critical TechWorks is a company formed due to a partnership between BMW Group and CriticalGroup. CTW focuses exclusively on supporting BMW in developing software for its connected vehicles and mobility services.</p>",
      "imageUrl": "bmw.png",
      "imageAlt": "BMW concept vehicle with Critical TechWorks branding",
      "company": "Critical TechWorks"
    },
    {
      "id": "wechangers",
      "title": "Changing the world with WeChangers",
      "description": "<p>The product WeChangers is a start from Porto with a bold vision. \"An interdependent and sustainable world with no poverty, no inequality, and no injustice, where our economic system prioritizes people and planet over profit.\"</p>",
      "imageUrl": "wechangers.png",
      "imageAlt": "WeChangers platform interface",
      "company": "WeChangers"
    },
    {
      "id": "trivago-business",
      "title": "Helping hoteliers to thrive with trivago Business Studio",
      "description": "<p>The product When I joined trivago back in 2016, the B2B team was a relatively small team helping hoteliers to perform better at trivago hotel search. The product was called Hotel Manager and it was used by more than 300k hoteliers.</p>",
      "imageUrl": "trivago-business.png",
      "imageAlt": "Trivago Business Studio interface screenshot",
      "company": "Trivago"
    },
    {
      "id": "geofusion",
      "title": "Supporting the strategy of global giants in Brazil with geomarketing",
      "description": "<p>The product Born in 1996 in São Paulo, Geofusion is a pioneer and the leader in the geographic intelligence market in Brazil, with clients like McDonald's, Heineken, Danone, Mastercard, and other global enterprises.</p>",
      "imageUrl": "geofusion.png",
      "imageAlt": "Geofusion geomarketing platform interface",
      "company": "Geofusion"
    }
  ]
}